[Frost_Trooper X2SoldierClassTemplate]
+DisplayName="Frost Trooper"
+ClassSummary="A Trooper that utilizes special freezing bullets to chill and slow down enemies as well as a frost infused gremlin."
+LeftAbilityTreeTitle="Captain Cold"
+RightAbilityTreeTitle="Mr.Freeze"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Frozen"
AbilityTreeTitles[2]="Gremlin"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Chill"

[Fire_Trooper X2SoldierClassTemplate]
+DisplayName="Fire Trooper"
+ClassSummary="A Trooper that utilizes special flaming bullets with their pistol to set enemies ablaze as well as a chemthrower to unleash their inner pyromaniac."
+LeftAbilityTreeTitle="Fire"
+RightAbilityTreeTitle="Flame"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Pyromaniac"
AbilityTreeTitles[2]="Sentry"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Fiery"

[Bio_Trooper X2SoldierClassTemplate]
+DisplayName="Bio Trooper"
+ClassSummary="A Trooper that utilizes special toxic rounds to poison enemies as well as finishing off weakened enemies."
+LeftAbilityTreeTitle="Poison"
+RightAbilityTreeTitle="Stabbey"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Assassin"
AbilityTreeTitles[2]="Killer"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Plague Doctor"

[Acid_Trooper X2SoldierClassTemplate]
+DisplayName="Acid Trooper"
+ClassSummary="A Trooper that utilizes special acidic rounds that shred armor and rupture enemies as well as devastating blade arts with their sword."
+LeftAbilityTreeTitle="Acid"
+RightAbilityTreeTitle="Sword"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="Blademaster"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Shredder"

[Shock_Trooper X2SoldierClassTemplate]
+DisplayName="Shock Trooper"
+ClassSummary="A Trooper that utilizes special electric rounds that shock enemies bypassing armor as well as an arc thrower."
+LeftAbilityTreeTitle="Taser"
+RightAbilityTreeTitle="Shocker"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Suppression"
AbilityTreeTitles[2]="Tazer"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Shocker"

[Blast_Trooper X2SoldierClassTemplate]
+DisplayName="Blast Trooper"
+ClassSummary="A Trooper that utilizes special explosive rounds that rupture enemies and damage cover as well as a rocket launcher."
+LeftAbilityTreeTitle="Blaster"
+RightAbilityTreeTitle="Rocketeer"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Demoman"
AbilityTreeTitles[2]="Rocketeer"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Boomer"

[Psionic_Trooper X2SoldierClassTemplate]
+DisplayName="Psionic Trooper"
+ClassSummary="A Trooper with psionic, shadow, and blood magic capable of great feats at an otherwordly cost"
+LeftAbilityTreeTitle="Psi"
+RightAbilityTreeTitle="Mob"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Shadow"
AbilityTreeTitles[2]="Blood"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Psycho"

[Slash_Trooper X2SoldierClassTemplate]
+DisplayName="Shield Trooper"
+ClassSummary="A Trooper that specialises in using their shield to set up their defense then shoot down foes with their rifle and sword bullets that are effective against psionic units."
+LeftAbilityTreeTitle="Psi"
+RightAbilityTreeTitle="Mob"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Turret"
AbilityTreeTitles[2]="Shield Wall"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="The Wall"

